In [2]:
import pandas as pd
import numpy as np

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avokado"])
string_data

0    aardvark
1         NaN
2        None
3     avokado
dtype: object

In [6]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = pd.Series([1,2,None], dtype=np.float64)
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

## Filtering out missing data

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
# This is same as 
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# dropna by default filters out all rows containing missing data
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
# Passing how="all" will drop only rows that contain all missing data 
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
# To drop columns param axis="columns" can be used
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.133428       NaN       NaN
1 -0.782415       NaN       NaN
2  0.847020       NaN -0.026591
3  0.908207       NaN -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [24]:
df.dropna()

          0         1         2
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [25]:
# tresh argument is a treshold for number of nan values in the row
df.dropna(thresh=2)

          0         1         2
2  0.847020       NaN -0.026591
3  0.908207       NaN -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

## Filling missing data

In [26]:
# fillna method is the workhorse
df.fillna(0)

          0         1         2
0  0.133428  0.000000  0.000000
1 -0.782415  0.000000  0.000000
2  0.847020  0.000000 -0.026591
3  0.908207  0.000000 -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [31]:
# fillna with a dict can use different fill value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.133428  0.500000  0.000000
1 -0.782415  0.500000  0.000000
2  0.847020  0.500000 -0.026591
3  0.908207  0.500000 -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [34]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.464487  0.543460 -1.233216
1 -0.047464 -0.650593 -1.689461
2  0.633390       NaN -1.305371
3 -0.360169       NaN  0.036989
4 -0.536153       NaN       NaN
5  0.940217       NaN       NaN

In [36]:
# we can use same interpolation methods as for reindexing: https://wesmckinney.com/book/pandas-basics#tbl-table_reindex_function
df.fillna(method = "ffill", limit=2)

/tmp/ipykernel_385/80795070.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", limit=2)

          0         1         2
0 -0.464487  0.543460 -1.233216
1 -0.047464 -0.650593 -1.689461
2  0.633390 -0.650593 -1.305371
3 -0.360169 -0.650593  0.036989
4 -0.536153       NaN  0.036989
5  0.940217       NaN  0.036989

In [38]:
# We can do other things like simple data inputation using median or mean statistics
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [48]:
df = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], 
                   "k2": [1, 1, 2, 2, 3, 4, 4]})
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   4
6  two   4

In [49]:
# DataFrame method duplicated returns true if values in the row are duplicate of values
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   4

In [52]:
# Both methods, dupicated and drop_duplicates consider all columns. 
# There is option to provide subsef of columns
df["v1"] = range(7)
# df
df.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
# duplicated and drop_duplicates by defautl keep the first value combination observed
# Passing keep="last" will keep the last valueo combination observed
df.drop_duplicates(subset=["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [58]:
# We can add a column animal for a food by using map method
# map method on a Series accepts functipn or a dictionary like object containing mapping 
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [63]:
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [64]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
# Replace multiple values 
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [67]:
# Pass different replacements
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
# Argument passed can be a dictinoary
df.replace({-999: np.nan, -1000: 0})

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   4   5
6  two   4   6

## Renaming Axis Indexes